import os
dir_path = os.path.dirname(os.path.realpath(__file__)) # Current file's directory


# ========= Paths ============
# Data for training VGG
DATA_DIR_TRAIN = r'/Users/stav/Projects/CodeSH/vgg_for_final_project/TRAIN'
# Vocabulary
WORDS_FILENAME = os.path.join(dir_path, "all_append_fatverb.txt")
# Examples directory
IMAGES_DIR     = os.path.join(dir_path, "data")

MODEL_PATH_ARCHITECTURE = os.path.join(dir_path, "model", "model_architecture.json")
MODEL_PATH_WEIGHTS      = os.path.join(dir_path, "model", "model_weights.h5")


# ========= Settings ============
IMAGE_SIZE = 32

# Define a dictionary to map the classification index to Hebrew letters
ABC = "אבגדהוזחטיכךלמםנןסעפףצץקרשת,"


TEST_SET = [("אבא.png", "אבא"),
("אבטיח.png", "אבטיח"),
("אוטובוס.png", "אוטובוס"),
("אופנוע.png", "אופנוע"),
("אף.png", "אף"),
("אצבעות.png", "אצבעות"),
("ארון.png", "ארון"),
("בית.png", "בית"),
("במבה.png", "במבה"),
("גזר.png", "גזר"),
("דבק.png", "דבק")  ,
("דלת.png", "דלת"),
("דף.png", "דף"),
("הורה.png", "הורה"),
("הלך.png", "הלך"),
("ורד.png", "ורד"),
("ורוד.png", "ורוד"),
("זרדים.png", "זרדים"),
("חדר.png", "חדר"),
("חוט.png", "חוט"),
("חול.png", "חול"),
("חלום.png", "חלום"),
("חמור.png", "חמור"),
("חמש.png", "חמש"),
("חפץ.png", "חפץ"),
("חשמל.png", "חשמל"),
("חתול.png", "חתול"),
("טרי.png", "טרי"),
("יד.png", "יד"),
("ידית.png", "ידית"),
("יהלום.png", "יהלום"),
("ילקוט.png", "ילקוט"),
("ים.png", "ים"),
("ירושלים.png", "ירושלים"),
("ישב.png", "ישב"),
("כובע.png", "כובע"),
("כוכב.png", "כוכב"),
("כחול.png", "כחול"),
("כיבס.png", "כיבס"),
("כסא.png", "כסא"),
("לישון.png", "לישון"),
("לכם.png", "לכם"),
("לשתות.png", "לשתות"),
("מאמר.png", "מאמר"),
("מבחן.png", "מבחן"),
("מגנט.png", "מגנט"),
("מחשב.png", "מחשב"),
("מטבח.png", "מטבח"),
("מכנסיים.png", "מכנסיים"),
("מלפפון.png", "מלפפון"),
("מנורה.png", "מנורה"),
("מסגרת.png", "מסגרת"),
("מסלול.png", "מסלול"),
("מפתח.png", "מפתח"),
("מקלדת.png", "מקלדת"),
("מקפיא.png", "מקפיא"),
("מתוכח.png", "מתוכח"),
("נבחנתי.png", "נבחנתי"),
("נס.png", "נס"),
("נעל.png", "נעל"),
("סוס.png", "סוס"),
("סילק.png", "סילק"),
("סלון.png", "סלון"),
("עברית.png", "עברית"),
("עדשים.png", "עדשים"),
("עט.png", "עט"),
("עכבר.png", "עכבר"),
("עמד.png", "עמד"),
("עמוד.png", "עמוד"),
("ענבים.png", "ענבים"),
("עץ.png", "עץ"),
("עשר.png", "עשר"),
("פנינה.png", "פנינה"),
("פס.png", "פס"),
("פרחים.png", "פרחים"),
("צבעים.png", "צבעים"),
("צדקה.png", "צדקה"),
("צעיף.png", "צעיף"),
("צרפתית.png", "צרפתית"),
("קובץ.png", "קובץ"),
("קלמר.png", "קלמר"),
("קם.png", "קם"),
("קפה.png", "קפה"),
("רגל.png", "רגל"),
("רוצה.png", "רוצה"),
("רחוב.png", "רחוב"),
("רכב.png", "רכב"),
("רעיון.png", "רעיון"),
("רציתי.png", "רציתי"),
("רשת.png", "רשת"),
("שולחן.png", "שולחן"),
("שטף.png", "שטף"),
("שילם.png", "שילם"),
("שם.png", "שם"),
("שמר.png", "שמר"),
("שמרן.png", "שמרן"),
("שעון.png", "שעון"),
("שתיה.png", "שתיה"),
("שתיים.png", "שתיים"),
("תכלת.png", "תכלת"),
("תלמיד.png", "תלמיד"),
("תמר.png", "תמר"),
("תפוח.png", "תפוח"),
("תצוגה.png", "תצוגה")]




